; ModuleID = 'codon'
source_filename = "/Users/pbanijamali/Desktop/Pouyeh/test_codes/benchmarks/codon/bench/sum/sum.py"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-darwin23.3.0"

%"std.internal.types.range.range:std.internal.types.range.range.__iter__:1[std.internal.types.range.range].209.Frame" = type { ptr, ptr, i64, { i64, i64, i64 }, i64, i64, i64, i2 }
%"__magic__.iter:0[Tuple.N2[str,str]].243.Frame" = type { ptr, ptr, { i64, ptr }, { { i64, ptr }, { i64, ptr } }, i2, i8 }
%"Tuple.N2[str,str]:Tuple.N2.__iter__:0[Tuple.N2[str,str]].245.Frame" = type { ptr, ptr, { i64, ptr }, { { i64, ptr }, { i64, ptr } }, ptr, i2 }
%"__magic__.iter:0[Tuple.N1[float]].337.Frame" = type { ptr, ptr, double, { double }, i2, i8 }
%"Tuple.N1[float]:Tuple.N1.__iter__:0[Tuple.N1[float]].339.Frame" = type { ptr, ptr, double, { double }, ptr, i2 }

@..argv = private global { i64, ptr } zeroinitializer, !dbg !0
@.._import_math_183_done = private global i8 0, !dbg !5
@.._import_sys_175_done = private global i8 0, !dbg !9
@.._import_time_185_done = private global i8 0, !dbg !11
@.Ellipsis = private global {} zeroinitializer, !dbg !13
@.INSERTION_SORT_THRESHOLD = private global i64 0, !dbg !18
@.MIN_GALLOP = private global i64 0, !dbg !22
@.NINTHER_THRESHOLD = private global i64 0, !dbg !25
@.PARTIAL_INSERTION_SORT_LIMIT = private global i64 0, !dbg !27
@.PyBool_FromLong = private global ptr null, !dbg !29

!332 = distinct !DIGlobalVariable(name: "PyTuple_Size", linkageName: "PyTuple_Size", scope: !2, file: !31, line: 39, type: !85, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "PyTuple_Type", linkageName: "PyTuple_Type", scope: !2, file: !31, line: 134, type: !35, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "PyUnicode_AsEncodedString", linkageName: "PyUnicode_AsEncodedString", scope: !2, file: !31, line: 42, type: !80, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "PyUnicode_DecodeFSDefaultAndSize", linkageName: "PyUnicode_DecodeFSDefaultAndSize", scope: !2, file: !31, line: 43, type: !164, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "PyUnicode_FromString", linkageName: "PyUnicode_FromString", scope: !2, file: !31, line: 44, type: !41, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "PyUnicode_Type", linkageName: "PyUnicode_Type", scope: !2, file: !31, line: 129, type: !35, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "Py_DecRef", linkageName: "Py_DecRef", scope: !2, file: !31, line: 9, type: !304, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "Py_EQ", linkageName: "Py_EQ", scope: !2, file: !31, line: 120, type: !21, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "Py_Ellipsis", linkageName: "Py_Ellipsis", scope: !2, file: !31, line: 116, type: !35, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "Py_False", linkageName: "Py_False", scope: !2, file: !31, line: 115, type: !35, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "Py_GE", linkageName: "Py_GE", scope: !2, file: !31, line: 123, type: !21, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "Py_GT", linkageName: "Py_GT", scope: !2, file: !31, line: 122, type: !21, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "Py_IncRef", linkageName: "Py_IncRef", scope: !2, file: !31, line: 10, type: !304, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "Py_Initialize", linkageName: "Py_Initialize", scope: !2, file: !31, line: 11, type: !359, isLocal: true, isDefinition: true)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!95}
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "Py_LE", linkageName: "Py_LE", scope: !2, file: !31, line: 119, type: !21, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "Py_LT", linkageName: "Py_LT", scope: !2, file: !31, line: 118, type: !21, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "Py_NE", linkageName: "Py_NE", scope: !2, file: !31, line: 121, type: !21, isLocal: true, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "Py_None", linkageName: "Py_None", scope: !2, file: !31, line: 113, type: !35, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "Py_NotImplemented", linkageName: "Py_NotImplemented", scope: !2, file: !31, line: 117, type: !35, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "Py_True", linkageName: "Py_True", scope: !2, file: !31, line: 114, type: !35, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "RTLD_GLOBAL", linkageName: "RTLD_GLOBAL", scope: !2, file: !376, line: 15, type: !21, isLocal: true, isDefinition: true)
!376 = !DIFile(filename: "dlopen.codon", directory: "/Users/pbanijamali/.codon/lib/codon/stdlib/internal")
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "RTLD_LOCAL", linkageName: "RTLD_LOCAL", scope: !2, file: !376, line: 16, type: !21, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "RTLD_NOW", linkageName: "RTLD_NOW", scope: !2, file: !376, line: 14, type: !21, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "_DEFAULT_IDENT", linkageName: "_DEFAULT_IDENT", scope: !2, file: !383, line: 95, type: !384, isLocal: true, isDefinition: true)
!383 = !DIFile(filename: "openmp.codon", directory: "/Users/pbanijamali/.codon/lib/codon/stdlib")
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident", scope: !383, file: !383, line: 44, size: 192, elements: !385)
!385 = !{!386, !387, !388, !389, !390}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !384, file: !383, line: 45, baseType: !276, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !384, file: !383, line: 46, baseType: !276, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !384, file: !383, line: 47, baseType: !276, size: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !384, file: !383, line: 48, baseType: !276, size: 32, offset: 96)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !384, file: !383, line: 49, baseType: !35, size: 64, offset: 128)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "_KMP_IDENT_KMPC", linkageName: "_KMP_IDENT_KMPC", scope: !2, file: !383, line: 8, type: !21, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "_MAX", linkageName: "_MAX.1", scope: !2, file: !7, line: 188, type: !21, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "_MIN", linkageName: "_MIN", scope: !2, file: !7, line: 187, type: !21, isLocal: true, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "_PY_INIT", linkageName: "_PY_INIT", scope: !2, file: !31, line: 160, type: !399, isLocal: true, isDefinition: true)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !400)
!400 = !{!401, !402}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !399, file: !15, line: 101, baseType: !21, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !399, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "_PY_INITIALIZED", linkageName: "_PY_INITIALIZED", scope: !2, file: !31, line: 192, type: !8, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "_PY_MODULE_CACHE", linkageName: "_PY_MODULE_CACHE", scope: !2, file: !31, line: 158, type: !407, isLocal: true, isDefinition: true)
!407 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !408)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,pyobj].contents", scope: !409, file: !409, size: 448, elements: !410)
!409 = !DIFile(filename: "", directory: ".")
!410 = !{!411, !413, !414, !415, !416, !419, !425}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !408, file: !412, line: 12, baseType: !21, size: 64)
!412 = !DIFile(filename: "dict.codon", directory: "/Users/pbanijamali/.codon/lib/codon/stdlib/internal/types/collections")
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !408, file: !412, line: 13, baseType: !21, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !408, file: !412, line: 14, baseType: !21, size: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !408, file: !412, line: 15, baseType: !21, size: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !408, file: !412, line: 17, baseType: !417, size: 64, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIBasicType(name: "UInt32", size: 32, encoding: DW_ATE_unsigned)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !408, file: !412, line: 18, baseType: !420, size: 64, offset: 320)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !422)
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !421, file: !15, line: 101, baseType: !21, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !421, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !408, file: !412, line: 19, baseType: !426, size: 64, offset: 384)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !428)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "pyobj.contents", scope: !409, file: !409, size: 64, elements: !429)
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !428, file: !15, line: 97, baseType: !35, size: 64)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "_REDUCTION_IDENT", linkageName: "_REDUCTION_IDENT", scope: !2, file: !383, line: 97, type: !433, isLocal: true, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident", scope: !383, file: !383, line: 44, size: 192, elements: !434)
!434 = !{!435, !436, !437, !438, !439}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !433, file: !383, line: 45, baseType: !276, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !433, file: !383, line: 46, baseType: !276, size: 32, offset: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !433, file: !383, line: 47, baseType: !276, size: 32, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !433, file: !383, line: 48, baseType: !276, size: 32, offset: 96)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !433, file: !383, line: 49, baseType: !35, size: 64, offset: 128)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "_ROUND_CEILING", linkageName: "_ROUND_CEILING", scope: !2, file: !7, line: 183, type: !21, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "_ROUND_FLOOR", linkageName: "_ROUND_FLOOR", scope: !2, file: !7, line: 184, type: !21, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "_ROUND_HALF_EVEN", linkageName: "_ROUND_HALF_EVEN", scope: !2, file: !7, line: 182, type: !21, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "_ROUND_UP", linkageName: "_ROUND_UP", scope: !2, file: !7, line: 185, type: !21, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "_STATIC_LOOP_IDENT", linkageName: "_STATIC_LOOP_IDENT", scope: !2, file: !383, line: 96, type: !450, isLocal: true, isDefinition: true)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident", scope: !383, file: !383, line: 44, size: 192, elements: !451)
!451 = !{!452, !453, !454, !455, !456}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !450, file: !383, line: 45, baseType: !276, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !450, file: !383, line: 46, baseType: !276, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !450, file: !383, line: 47, baseType: !276, size: 32, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !450, file: !383, line: 48, baseType: !276, size: 32, offset: 96)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !450, file: !383, line: 49, baseType: !35, size: 64, offset: 128)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "__name__", linkageName: "__name__.44", scope: !2, file: !3, line: 2, type: !459, isLocal: true, isDefinition: true)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !460)
!460 = !{!461, !462}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !459, file: !15, line: 101, baseType: !21, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !459, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "__name__", linkageName: "__name__.45", scope: !2, file: !7, line: 3, type: !465, isLocal: true, isDefinition: true)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !466)
!466 = !{!467, !468}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !465, file: !15, line: 101, baseType: !21, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !465, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "__name__", linkageName: "__name__.46", scope: !2, file: !7, line: 222, type: !471, isLocal: true, isDefinition: true)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !472)
!472 = !{!473, !474}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !471, file: !15, line: 101, baseType: !21, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !471, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "__pyenv__", linkageName: "__pyenv__", scope: !2, file: !31, line: 1464, type: !477, isLocal: true, isDefinition: true)
!477 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !478)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "pyobj.contents", scope: !409, file: !409, size: 64, elements: !479)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !478, file: !15, line: 97, baseType: !35, size: 64)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "__vtable_size__", linkageName: "__vtable_size__", scope: !2, file: !483, line: 15, type: !21, isLocal: true, isDefinition: true)
!483 = !DIFile(filename: "internal.codon", directory: "/Users/pbanijamali/.codon/lib/codon/stdlib/internal")
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "__vtables__", linkageName: "__vtables__", scope: !2, file: !483, line: 14, type: !486, isLocal: true, isDefinition: true)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "_default_lock", linkageName: "_default_lock", scope: !2, file: !383, line: 792, type: !489, isLocal: true, isDefinition: true)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Lock", scope: !383, file: !383, line: 29, size: 256, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "a1", scope: !489, file: !383, line: 30, baseType: !276, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "a2", scope: !489, file: !383, line: 31, baseType: !276, size: 32, offset: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "a3", scope: !489, file: !383, line: 32, baseType: !276, size: 32, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "a4", scope: !489, file: !383, line: 33, baseType: !276, size: 32, offset: 96)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "a5", scope: !489, file: !383, line: 34, baseType: !276, size: 32, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "a6", scope: !489, file: !383, line: 35, baseType: !276, size: 32, offset: 160)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "a7", scope: !489, file: !383, line: 36, baseType: !276, size: 32, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "a8", scope: !489, file: !383, line: 37, baseType: !276, size: 32, offset: 224)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "_stdout", linkageName: "_stdout", scope: !2, file: !501, line: 16, type: !35, isLocal: true, isDefinition: true)
!501 = !DIFile(filename: "builtin.codon", directory: "/Users/pbanijamali/.codon/lib/codon/stdlib/internal")
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "argv", linkageName: "argv", scope: !2, file: !504, line: 3, type: !505, isLocal: true, isDefinition: true)
!504 = !DIFile(filename: "sys.codon", directory: "/Users/pbanijamali/.codon/lib/codon/stdlib")
!505 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !506)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.ptr.List[str].contents", scope: !409, file: !409, size: 192, elements: !507)
!507 = !{!508, !510}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !506, file: !509, line: 195, baseType: !21, size: 64)
!509 = !DIFile(filename: "ptr.codon", directory: "/Users/pbanijamali/.codon/lib/codon/stdlib/internal/types")
!510 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !506, file: !509, line: 196, baseType: !511, size: 128, offset: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "Array[str]", scope: !509, file: !509, line: 196, size: 128, elements: !512)
!512 = !{!513, !514}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !511, file: !15, line: 108, baseType: !21, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !511, file: !15, line: 109, baseType: !515, size: 64, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !517)
!517 = !{!518, !519}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !516, file: !15, line: 101, baseType: !21, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !516, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "block", linkageName: "block", scope: !2, file: !522, line: 216, type: !523, isLocal: true, isDefinition: true)
!522 = !DIFile(filename: "gpu.codon", directory: "/Users/pbanijamali/.codon/lib/codon/stdlib")
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.gpu.Block", scope: !522, file: !522, line: 117, elements: !17)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "e", linkageName: "e.8", scope: !2, file: !526, line: 13, type: !49, isLocal: true, isDefinition: true)
!526 = !DIFile(filename: "math.codon", directory: "/Users/pbanijamali/.codon/lib/codon/stdlib")
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "e32", linkageName: "e32", scope: !2, file: !526, line: 748, type: !529, isLocal: true, isDefinition: true)
!529 = !DIBasicType(name: "float32", size: 32, encoding: DW_ATE_float)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "environ", linkageName: "environ", scope: !2, file: !532, line: 54, type: !533, isLocal: true, isDefinition: true)
!532 = !DIFile(filename: "__init__.codon", directory: "/Users/pbanijamali/.codon/lib/codon/stdlib/os")
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.os.__init__.EnvMap", scope: !532, file: !532, line: 11, size: 64, elements: !534)
!534 = !{!535}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_map", scope: !533, file: !532, line: 12, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !537)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !409, file: !409, size: 448, elements: !538)
!538 = !{!539, !540, !541, !542, !543, !544, !550}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !537, file: !412, line: 12, baseType: !21, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !537, file: !412, line: 13, baseType: !21, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !537, file: !412, line: 14, baseType: !21, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !537, file: !412, line: 15, baseType: !21, size: 64, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !537, file: !412, line: 17, baseType: !417, size: 64, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !537, file: !412, line: 18, baseType: !545, size: 64, offset: 320)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !547)
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !546, file: !15, line: 101, baseType: !21, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !546, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !537, file: !412, line: 19, baseType: !545, size: 64, offset: 384)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "float", linkageName: "float.MIN_10_EXP", scope: !2, file: !15, line: 37, type: !21, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "float32", linkageName: "float32.MIN_10_EXP", scope: !2, file: !15, line: 44, type: !21, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "grid", linkageName: "grid", scope: !2, file: !522, line: 217, type: !557, isLocal: true, isDefinition: true)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.gpu.Grid", scope: !522, file: !522, line: 177, elements: !17)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "inf", linkageName: "inf", scope: !2, file: !526, line: 16, type: !49, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "inf32", linkageName: "inf32", scope: !2, file: !526, line: 752, type: !529, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "int", linkageName: "int.MAX", scope: !2, file: !15, line: 30, type: !21, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "maxsize", linkageName: "maxsize", scope: !2, file: !504, line: 12, type: !21, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "nan", linkageName: "nan.2", scope: !2, file: !526, line: 17, type: !49, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "nan32", linkageName: "nan32", scope: !2, file: !526, line: 753, type: !529, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "pi", linkageName: "pi", scope: !2, file: !526, line: 14, type: !49, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "pi32", linkageName: "pi32", scope: !2, file: !526, line: 749, type: !529, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.ArithmeticError._pytype", scope: !2, file: !576, line: 101, type: !35, isLocal: true, isDefinition: true)
!576 = !DIFile(filename: "error.codon", directory: "/Users/pbanijamali/.codon/lib/codon/stdlib/internal/types")
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.AssertionError._pytype", scope: !2, file: !576, line: 149, type: !35, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.AttributeError._pytype", scope: !2, file: !576, line: 122, type: !35, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.BaseException._pytype", scope: !2, file: !576, line: 5, type: !35, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.CError._pytype", scope: !2, file: !576, line: 82, type: !35, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.Exception._pytype", scope: !2, file: !576, line: 30, type: !35, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.IOError._pytype", scope: !2, file: !576, line: 49, type: !35, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.IndexError._pytype", scope: !2, file: !576, line: 70, type: !35, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.KeyError._pytype", scope: !2, file: !576, line: 76, type: !35, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.LookupError._pytype", scope: !2, file: !576, line: 61, type: !35, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.NameError._pytype", scope: !2, file: !576, line: 37, type: !35, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.NotImplementedError._pytype", scope: !2, file: !576, line: 137, type: !35, isLocal: true, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.OSError._pytype", scope: !2, file: !576, line: 43, type: !35, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.OverflowError._pytype", scope: !2, file: !576, line: 116, type: !35, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.RuntimeError._pytype", scope: !2, file: !576, line: 128, type: !35, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.StopIteration._pytype", scope: !2, file: !576, line: 143, type: !35, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.SystemExit._pytype", scope: !2, file: !576, line: 155, type: !35, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.TypeError._pytype", scope: !2, file: !576, line: 95, type: !35, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.ValueError._pytype", scope: !2, file: !576, line: 55, type: !35, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.ZeroDivisionError._pytype", scope: !2, file: !576, line: 107, type: !35, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "stderr", linkageName: "stderr", scope: !2, file: !504, line: 7, type: !617, isLocal: true, isDefinition: true)
!617 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !618)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.file.File.contents", scope: !409, file: !409, size: 192, elements: !619)
!619 = !{!620, !622, !623}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !618, file: !621, line: 6, baseType: !21, size: 64)
!621 = !DIFile(filename: "file.codon", directory: "/Users/pbanijamali/.codon/lib/codon/stdlib/internal")
!622 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !618, file: !621, line: 7, baseType: !35, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !618, file: !621, line: 8, baseType: !35, size: 64, offset: 128)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "stdin", linkageName: "stdin", scope: !2, file: !504, line: 5, type: !626, isLocal: true, isDefinition: true)
!626 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !627)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.file.File.contents", scope: !409, file: !409, size: 192, elements: !628)
!628 = !{!629, !630, !631}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !627, file: !621, line: 6, baseType: !21, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !627, file: !621, line: 7, baseType: !35, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !627, file: !621, line: 8, baseType: !35, size: 64, offset: 128)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "stdout", linkageName: "stdout", scope: !2, file: !504, line: 6, type: !634, isLocal: true, isDefinition: true)
!634 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !635)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.file.File.contents", scope: !409, file: !409, size: 192, elements: !636)
!636 = !{!637, !638, !639}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !635, file: !621, line: 6, baseType: !21, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !635, file: !621, line: 7, baseType: !35, size: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !635, file: !621, line: 8, baseType: !35, size: 64, offset: 128)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "tau", linkageName: "tau", scope: !2, file: !526, line: 15, type: !49, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "tau32", linkageName: "tau32", scope: !2, file: !526, line: 750, type: !529, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "thread", linkageName: "thread", scope: !2, file: !522, line: 215, type: !646, isLocal: true, isDefinition: true)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.gpu.Thread", scope: !522, file: !522, line: 82, elements: !17)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "warp", linkageName: "warp", scope: !2, file: !522, line: 218, type: !649, isLocal: true, isDefinition: true)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.gpu.Warp", scope: !522, file: !522, line: 204, elements: !17)
!650 = !DIFile(filename: "<internal>", directory: ".")
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: ".Array[str]", scope: !409, file: !409, size: 128, elements: !652)
!652 = !{!653, !654}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !651, file: !409, baseType: !21, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !651, file: !409, baseType: !655, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !657)
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !656, file: !15, line: 101, baseType: !21, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !656, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!660 = !{i32 2, !"Debug Info Version", i32 3}
!661 = !{i32 2, !"Dwarf Version", i32 2}
!662 = distinct !DISubprogram(name: "Tuple.N0.__new__", linkageName: "Tuple.N0.__new__:0.2", scope: !663, file: !663, line: 878, type: !664, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!663 = !DIFile(filename: "<generated>", directory: ".")
!664 = !DISubroutineType(types: !665)
!665 = !{!666}
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple.N0", scope: !663, file: !663, line: 861, elements: !17)
!667 = !DILocation(line: 878, column: 878, scope: !662)
!668 = distinct !DISubprogram(name: "ellipsis.__new__", linkageName: "ellipsis.__new__:0.3", scope: !15, file: !15, line: 151, type: !669, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!669 = !DISubroutineType(types: !670)
!670 = !{!16}
!671 = !DILocation(line: 151, column: 5, scope: !668)
!672 = !DILocation(line: 152, column: 16, scope: !668)
!673 = distinct !DISubprogram(name: "Pointer[byte].__new__", linkageName: "Ptr[byte]:Ptr.__new__:0.4", scope: !509, file: !509, line: 7, type: !69, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!674 = !DILocation(line: 7, column: 5, scope: !673)
!675 = distinct !DISubprogram(name: "Pointer[Pointer[Pointer[byte]]].__new__", linkageName: "Ptr[Ptr[Ptr[byte]]]:Ptr.__new__:0.5", scope: !509, file: !509, line: 7, type: !676, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!676 = !DISubroutineType(types: !677)
!677 = !{!486}
!678 = !DILocation(line: 7, column: 5, scope: !675)
!679 = distinct !DISubprogram(name: "int.__float__", linkageName: "int:int.__float__:0[int].6", scope: !680, file: !680, line: 28, type: !681, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!680 = !DIFile(filename: "int.codon", directory: "/Users/pbanijamali/.codon/lib/codon/stdlib/internal/types")
!681 = !DISubroutineType(types: !682)
!682 = !{!49, !21}
!683 = !DILocation(line: 28, column: 5, scope: !679)
!684 = distinct !DISubprogram(name: "float.__new__", linkageName: "float.__new__:1[int].8", scope: !685, file: !685, line: 12, type: !681, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !686)
!685 = !DIFile(filename: "float.codon", directory: "/Users/pbanijamali/.codon/lib/codon/stdlib/internal/types")
!686 = !{!687}
!687 = !DILocalVariable(name: "what", arg: 1, scope: !684, file: !409, type: !21)
!688 = !DILocation(line: 12, column: 5, scope: !684)
!689 = !DILocation(line: 0, scope: !684)
!690 = !DILocation(line: 17, column: 20, scope: !684)
!691 = !DILocation(line: 28, column: 5, scope: !679, inlinedAt: !692)
!692 = distinct !DILocation(line: 17, column: 20, scope: !684)
!693 = distinct !DISubprogram(name: "int.__add__", linkageName: "int:int.__add__:1[int,int].10", scope: !680, file: !680, line: 94, type: !694, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!694 = !DISubroutineType(types: !695)
!695 = !{!21, !21, !21}
!696 = !DILocation(line: 94, column: 5, scope: !693)
!697 = distinct !DISubprogram(name: "sizeof", linkageName: "std.internal.gc.sizeof:0[,Ptr[Ptr[byte]]].13", scope: !698, file: !698, line: 59, type: !699, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!698 = !DIFile(filename: "gc.codon", directory: "/Users/pbanijamali/.codon/lib/codon/stdlib/internal")
!699 = !DISubroutineType(types: !700)
!700 = !{!21}
!701 = !DILocation(line: 59, column: 1, scope: !697)
!702 = !DILocation(line: 60, column: 12, scope: !697)
!703 = distinct !DISubprogram(name: "int.__mul__", linkageName: "int:int.__mul__:1[int,int].14", scope: !680, file: !680, line: 124, type: !694, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!704 = !DILocation(line: 124, column: 5, scope: !703)
!705 = distinct !DISubprogram(name: "alloc_atomic_uncollectable", linkageName: "std.internal.gc.alloc_atomic_uncollectable:0[int].19", scope: !698, file: !698, line: 81, type: !33, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !706)
!706 = !{!707}
!707 = !DILocalVariable(name: "sz", arg: 1, scope: !705, file: !409, type: !21)
!708 = !DILocation(line: 81, column: 1, scope: !705)
!709 = !DILocation(line: 0, scope: !705)
!710 = !DILocation(line: 82, column: 43, scope: !705)
!711 = distinct !DISubprogram(name: "Pointer[Pointer[Pointer[byte]]].__new__", linkageName: "Ptr[Ptr[Ptr[byte]]]:Ptr.__new__:3[Ptr[byte]].21", scope: !509, file: !509, line: 23, type: !712, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!712 = !DISubroutineType(types: !713)
!713 = !{!486, !35}
!714 = !DILocation(line: 23, column: 5, scope: !711)
!715 = distinct !DISubprogram(name: "__internal__.class_populate_vtables", linkageName: "__internal__.class_populate_vtables:0.23", scope: !483, file: !483, line: 71, type: !360, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!716 = !DILocation(line: 71, column: 5, scope: !715)
!717 = distinct !DISubprogram(name: "__internal__.class_init_vtables", linkageName: "__internal__.class_init_vtables:0.24", scope: !483, file: !483, line: 62, type: !360, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !718)
!718 = !{!719}
!719 = !DILocalVariable(name: "sz", scope: !717, file: !483, line: 67, type: !21)
!720 = !DILocation(line: 62, column: 5, scope: !717)
!721 = !DILocation(line: 67, column: 9, scope: !717)
!722 = !DILocation(line: 67, column: 32, scope: !717)
!723 = !DILocation(line: 68, column: 65, scope: !717)
!724 = !DILocation(line: 68, column: 70, scope: !717)
!725 = !DILocation(line: 124, column: 5, scope: !703, inlinedAt: !726)
!726 = distinct !DILocation(line: 68, column: 70, scope: !717)
!727 = !DILocation(line: 69, column: 9, scope: !717)
!728 = distinct !DISubprogram(name: "Pointer[str].__new__", linkageName: "Ptr.__new__:1.25", scope: !509, file: !509, line: 11, type: !729, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!729 = !DISubroutineType(types: !730)
!730 = !{!731, !21}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !733)
!733 = !{!734, !735}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !732, file: !15, line: 101, baseType: !21, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !732, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!736 = !DILocation(line: 11, column: 5, scope: !728)
!737 = distinct !DISubprogram(name: "Tuple.N2[int,Ptr[str]].__new__", linkageName: "Tuple.N2.__new__:0.27", scope: !663, file: !663, line: 854, type: !738, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!738 = !DISubroutineType(types: !739)
!739 = !{!740, !21, !744}
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple.N2[int,Ptr[str]]", scope: !663, file: !663, line: 837, size: 128, elements: !741)
!741 = !{!742, !743}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "item1", scope: !740, file: !663, line: 814, baseType: !21, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "item2", scope: !740, file: !663, line: 814, baseType: !744, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !746)
!746 = !{!747, !748}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !745, file: !15, line: 101, baseType: !21, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !745, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!749 = !DILocation(line: 854, column: 854, scope: !737)
!750 = distinct !DISubprogram(name: "Array[str].__new__", linkageName: "Array[str]:Array.__new__:1[int].30", scope: !751, file: !751, line: 10, type: !752, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !763)
!751 = !DIFile(filename: "array.codon", directory: "/Users/pbanijamali/.codon/lib/codon/stdlib/internal/types")
!752 = !DISubroutineType(types: !753)
!753 = !{!754, !21}
!754 = !DICompositeType(tag: DW_TAG_structure_type, name: "Array[str]", scope: !509, file: !509, line: 196, size: 128, elements: !755)
!755 = !{!756, !757}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !754, file: !15, line: 108, baseType: !21, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !754, file: !15, line: 109, baseType: !758, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !760)
!760 = !{!761, !762}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !759, file: !15, line: 101, baseType: !21, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !759, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!763 = !{!764}
!764 = !DILocalVariable(name: "sz", arg: 1, scope: !750, file: !409, type: !21)
!765 = !DILocation(line: 10, column: 5, scope: !750)
!766 = !DILocation(line: 0, scope: !750)
!767 = !DILocation(line: 11, column: 17, scope: !750)
!768 = !DILocation(line: 11, column: 28, scope: !750)
!769 = !DILocation(line: 11, column: 5, scope: !728, inlinedAt: !770)
!770 = distinct !DILocation(line: 11, column: 28, scope: !750)
!771 = !DILocation(line: 854, column: 854, scope: !737, inlinedAt: !772)
!772 = distinct !DILocation(line: 11, column: 28, scope: !750)
!773 = distinct !DISubprogram(name: "std.internal.internal.Import.__new__", linkageName: "std.internal.internal.Import.__new__:0.32", scope: !663, file: !663, line: 252, type: !774, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!774 = !DISubroutineType(types: !775)
!775 = !{!776, !779, !779}
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.internal.Import", scope: !483, file: !483, line: 641, size: 256, elements: !777)
!777 = !{!778, !783}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !776, file: !483, line: 642, baseType: !779, size: 128)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !780)
!780 = !{!781, !782}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !779, file: !15, line: 101, baseType: !21, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !779, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !776, file: !483, line: 643, baseType: !779, size: 128, offset: 128)
!784 = !DILocation(line: 252, column: 252, scope: !773)
!785 = distinct !DISubprogram(name: "check_N", linkageName: "std.internal.types.intn.check_N:0[,32].36", scope: !786, file: !786, line: 5, type: !360, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!786 = !DIFile(filename: "intn.codon", directory: "/Users/pbanijamali/.codon/lib/codon/stdlib/internal/types")
!787 = !DILocation(line: 5, column: 1, scope: !785)
!788 = distinct !DISubprogram(name: "__internal__.int_trunc", linkageName: "__internal__.int_trunc:0[int,64,32].37", scope: !483, file: !483, line: 238, type: !789, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!789 = !DISubroutineType(types: !790)
!790 = !{!276, !21}
!791 = !DILocation(line: 238, column: 5, scope: !788)
!792 = distinct !DISubprogram(name: "Int32.__new__", linkageName: "Int[32]:Int.__new__:2[int].39", scope: !786, file: !786, line: 20, type: !789, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !793)
!793 = !{!794}
!794 = !DILocalVariable(name: "what", arg: 1, scope: !792, file: !409, type: !21)
!795 = !DILocation(line: 20, column: 5, scope: !792)
!796 = !DILocation(line: 0, scope: !792)
!797 = !DILocation(line: 21, column: 9, scope: !792)
!798 = !DILocation(line: 23, column: 43, scope: !792)
!799 = !DILocation(line: 238, column: 5, scope: !788, inlinedAt: !800)
!800 = distinct !DILocation(line: 23, column: 43, scope: !792)
!801 = distinct !DISubprogram(name: "int.__or__", linkageName: "int.__or__:0[int,int].41", scope: !680, file: !680, line: 200, type: !694, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!802 = !DILocation(line: 200, column: 5, scope: !801)
!803 = distinct !DISubprogram(name: "std.openmp.Ident.__new__", linkageName: "std.openmp.Ident.__new__:0.44", scope: !663, file: !663, line: 385, type: !804, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!804 = !DISubroutineType(types: !805)
!805 = !{!806, !276, !276, !276, !276, !35}
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident", scope: !383, file: !383, line: 44, size: 192, elements: !807)
!807 = !{!808, !809, !810, !811, !812}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !806, file: !383, line: 45, baseType: !276, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !806, file: !383, line: 46, baseType: !276, size: 32, offset: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !806, file: !383, line: 47, baseType: !276, size: 32, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !806, file: !383, line: 48, baseType: !276, size: 32, offset: 96)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !806, file: !383, line: 49, baseType: !35, size: 64, offset: 128)
!813 = !DILocation(line: 385, column: 385, scope: !803)
!814 = distinct !DISubprogram(name: "std.openmp.Ident.__new__", linkageName: "std.openmp.Ident.__new__:1[int,str].50", scope: !383, file: !383, line: 51, type: !815, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !828)
!815 = !DISubroutineType(types: !816)
!816 = !{!817, !21, !824}
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident", scope: !383, file: !383, line: 44, size: 192, elements: !818)
!818 = !{!819, !820, !821, !822, !823}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !817, file: !383, line: 45, baseType: !276, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !817, file: !383, line: 46, baseType: !276, size: 32, offset: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !817, file: !383, line: 47, baseType: !276, size: 32, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !817, file: !383, line: 48, baseType: !276, size: 32, offset: 96)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !817, file: !383, line: 49, baseType: !35, size: 64, offset: 128)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !824, file: !15, line: 101, baseType: !21, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !824, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!828 = !{!829, !830}
!829 = !DILocalVariable(name: "flags", arg: 1, scope: !814, file: !409, type: !21)
!830 = !DILocalVariable(name: "source", arg: 2, scope: !814, file: !409, type: !831)
!831 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !832)
!832 = !{!833, !834}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !831, file: !15, line: 101, baseType: !21, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !831, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!835 = !DILocation(line: 51, column: 5, scope: !814)
!836 = !DILocation(line: 0, scope: !814)
!837 = !DILocation(line: 52, column: 26, scope: !814)
!838 = !DILocation(line: 52, column: 34, scope: !814)
!839 = !DILocation(line: 52, column: 42, scope: !814)
!840 = !DILocation(line: 200, column: 5, scope: !801, inlinedAt: !841)
!841 = distinct !DILocation(line: 52, column: 42, scope: !814)
!842 = !DILocation(line: 52, column: 64, scope: !814)
!843 = !DILocation(line: 52, column: 72, scope: !814)
!844 = !DILocation(line: 52, column: 76, scope: !814)
!845 = !DILocation(line: 385, column: 385, scope: !803, inlinedAt: !846)
!846 = distinct !DILocation(line: 52, column: 76, scope: !814)
!847 = distinct !DISubprogram(name: "_default_loc", linkageName: "std.openmp._default_loc:0.53", scope: !383, file: !383, line: 99, type: !848, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!848 = !DISubroutineType(types: !849)
!849 = !{!850}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident", scope: !383, file: !383, line: 44, size: 192, elements: !852)
!852 = !{!853, !854, !855, !856, !857}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !851, file: !383, line: 45, baseType: !276, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !851, file: !383, line: 46, baseType: !276, size: 32, offset: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !851, file: !383, line: 47, baseType: !276, size: 32, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !851, file: !383, line: 48, baseType: !276, size: 32, offset: 96)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !851, file: !383, line: 49, baseType: !35, size: 64, offset: 128)
!858 = !DILocation(line: 99, column: 1, scope: !847)
!859 = !DILocation(line: 100, column: 12, scope: !847)
!860 = distinct !DISubprogram(name: "_static_loop_loc", linkageName: "std.openmp._static_loop_loc:0.54", scope: !383, file: !383, line: 104, type: !861, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!861 = !DISubroutineType(types: !862)
!862 = !{!863}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident", scope: !383, file: !383, line: 44, size: 192, elements: !865)
!865 = !{!866, !867, !868, !869, !870}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !864, file: !383, line: 45, baseType: !276, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !864, file: !383, line: 46, baseType: !276, size: 32, offset: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !864, file: !383, line: 47, baseType: !276, size: 32, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !864, file: !383, line: 48, baseType: !276, size: 32, offset: 96)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !864, file: !383, line: 49, baseType: !35, size: 64, offset: 128)
!871 = !DILocation(line: 104, column: 1, scope: !860)
!872 = !DILocation(line: 105, column: 12, scope: !860)
!873 = distinct !DISubprogram(name: "_reduction_loc", linkageName: "std.openmp._reduction_loc:0.55", scope: !383, file: !383, line: 109, type: !874, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!874 = !DISubroutineType(types: !875)
!875 = !{!876}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident", scope: !383, file: !383, line: 44, size: 192, elements: !878)
!878 = !{!879, !880, !881, !882, !883}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !877, file: !383, line: 45, baseType: !276, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !877, file: !383, line: 46, baseType: !276, size: 32, offset: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !877, file: !383, line: 47, baseType: !276, size: 32, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !877, file: !383, line: 48, baseType: !276, size: 32, offset: 96)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !877, file: !383, line: 49, baseType: !35, size: 64, offset: 128)
!884 = !DILocation(line: 109, column: 1, scope: !873)
!885 = !DILocation(line: 110, column: 12, scope: !873)
!886 = distinct !DISubprogram(name: "std.openmp.Lock.__new__", linkageName: "std.openmp.Lock.__new__:0.56", scope: !663, file: !663, line: 364, type: !887, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!887 = !DISubroutineType(types: !888)
!888 = !{!889, !276, !276, !276, !276, !276, !276, !276, !276}
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Lock", scope: !383, file: !383, line: 29, size: 256, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896, !897, !898}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "a1", scope: !889, file: !383, line: 30, baseType: !276, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "a2", scope: !889, file: !383, line: 31, baseType: !276, size: 32, offset: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "a3", scope: !889, file: !383, line: 32, baseType: !276, size: 32, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "a4", scope: !889, file: !383, line: 33, baseType: !276, size: 32, offset: 96)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "a5", scope: !889, file: !383, line: 34, baseType: !276, size: 32, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "a6", scope: !889, file: !383, line: 35, baseType: !276, size: 32, offset: 160)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "a7", scope: !889, file: !383, line: 36, baseType: !276, size: 32, offset: 192)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "a8", scope: !889, file: !383, line: 37, baseType: !276, size: 32, offset: 224)
!899 = !DILocation(line: 364, column: 364, scope: !886)
!900 = distinct !DISubprogram(name: "std.openmp.Lock.__new__", linkageName: "std.openmp.Lock.__new__:1.65", scope: !383, file: !383, line: 39, type: !901, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !913)
!901 = !DISubroutineType(types: !902)
!902 = !{!903}
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Lock", scope: !383, file: !383, line: 29, size: 256, elements: !904)
!904 = !{!905, !906, !907, !908, !909, !910, !911, !912}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "a1", scope: !903, file: !383, line: 30, baseType: !276, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "a2", scope: !903, file: !383, line: 31, baseType: !276, size: 32, offset: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "a3", scope: !903, file: !383, line: 32, baseType: !276, size: 32, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "a4", scope: !903, file: !383, line: 33, baseType: !276, size: 32, offset: 96)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "a5", scope: !903, file: !383, line: 34, baseType: !276, size: 32, offset: 128)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "a6", scope: !903, file: !383, line: 35, baseType: !276, size: 32, offset: 160)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "a7", scope: !903, file: !383, line: 36, baseType: !276, size: 32, offset: 192)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "a8", scope: !903, file: !383, line: 37, baseType: !276, size: 32, offset: 224)
!913 = !{!914}
!914 = !DILocalVariable(name: "z", scope: !900, file: !383, line: 40, type: !276)
!915 = !DILocation(line: 39, column: 5, scope: !900)
!916 = !DILocation(line: 40, column: 9, scope: !900)
!917 = !DILocation(line: 40, column: 17, scope: !900)
!918 = !DILocation(line: 41, column: 21, scope: !900)
!919 = !DILocation(line: 41, column: 24, scope: !900)
!920 = !DILocation(line: 41, column: 27, scope: !900)
!921 = !DILocation(line: 41, column: 30, scope: !900)
!922 = !DILocation(line: 41, column: 33, scope: !900)
!923 = !DILocation(line: 41, column: 36, scope: !900)
!924 = !DILocation(line: 41, column: 39, scope: !900)
!925 = !DILocation(line: 41, column: 42, scope: !900)
!926 = !DILocation(line: 364, column: 364, scope: !886, inlinedAt: !927)
!927 = distinct !DILocation(line: 41, column: 42, scope: !900)
!928 = distinct !DISubprogram(name: "std.gpu.Thread.__new__", linkageName: "std.gpu.Thread.__new__:0.66", scope: !663, file: !663, line: 574, type: !929, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!929 = !DISubroutineType(types: !930)
!930 = !{!646}
!931 = !DILocation(line: 574, column: 574, scope: !928)
!932 = distinct !DISubprogram(name: "std.gpu.Block.__new__", linkageName: "std.gpu.Block.__new__:0.67", scope: !663, file: !663, line: 595, type: !933, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!933 = !DISubroutineType(types: !934)
!934 = !{!523}
!935 = !DILocation(line: 595, column: 595, scope: !932)
!936 = distinct !DISubprogram(name: "std.gpu.Grid.__new__", linkageName: "std.gpu.Grid.__new__:0.68", scope: !663, file: !663, line: 616, type: !937, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!937 = !DISubroutineType(types: !938)
!938 = !{!557}
!939 = !DILocation(line: 616, column: 616, scope: !936)
!940 = distinct !DISubprogram(name: "std.gpu.Warp.__new__", linkageName: "std.gpu.Warp.__new__:0.69", scope: !663, file: !663, line: 637, type: !941, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!941 = !DISubroutineType(types: !942)
!942 = !{!649}
!943 = !DILocation(line: 637, column: 637, scope: !940)
!944 = distinct !DISubprogram(name: "Tuple.N4[std.gpu.Thread,std.gpu.Block,std.gpu.Grid,std.gpu.Warp].__new__", linkageName: "Tuple.N4.__new__:0.70", scope: !663, file: !663, line: 974, type: !945, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!945 = !DISubroutineType(types: !946)
!946 = !{!947, !646, !523, !557, !649}
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple.N4[std.gpu.Thread,std.gpu.Block,std.gpu.Grid,std.gpu.Warp]", scope: !663, file: !663, line: 957, elements: !948)
!948 = !{!949, !951, !952, !953}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "item1", scope: !947, file: !950, line: 12, baseType: !646)
!950 = !DIFile(filename: "slice.codon", directory: "/Users/pbanijamali/.codon/lib/codon/stdlib/internal/types")
!951 = !DIDerivedType(tag: DW_TAG_member, name: "item2", scope: !947, file: !950, line: 12, baseType: !523)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "item3", scope: !947, file: !950, line: 12, baseType: !557)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "item4", scope: !947, file: !950, line: 12, baseType: !649)
!954 = !DILocation(line: 974, column: 974, scope: !944)
!955 = distinct !DISubprogram(name: "_catch", linkageName: "std.gpu._catch:0.75", scope: !522, file: !522, line: 220, type: !956, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!956 = !DISubroutineType(types: !957)
!957 = !{!958}
!958 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple.N4[std.gpu.Thread,std.gpu.Block,std.gpu.Grid,std.gpu.Warp]", scope: !663, file: !663, line: 957, elements: !959)
!959 = !{!960, !961, !962, !963}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "item1", scope: !958, file: !950, line: 12, baseType: !646)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "item2", scope: !958, file: !950, line: 12, baseType: !523)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "item3", scope: !958, file: !950, line: 12, baseType: !557)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "item4", scope: !958, file: !950, line: 12, baseType: !649)
!964 = !DILocation(line: 220, column: 1, scope: !955)
!965 = !DILocation(line: 221, column: 13, scope: !955)
!966 = !DILocation(line: 221, column: 21, scope: !955)
!967 = !DILocation(line: 221, column: 28, scope: !955)
!968 = !DILocation(line: 221, column: 34, scope: !955)
!969 = !DILocation(line: 974, column: 974, scope: !944, inlinedAt: !970)
!970 = distinct !DILocation(line: 221, column: 34, scope: !955)
!971 = distinct !DISubprogram(name: "sizeof", linkageName: "std.internal.gc.sizeof:0[,Tuple.N7[int,int,int,int,Ptr[UInt[32]],Ptr[str],Ptr[str]]].77", scope: !698, file: !698, line: 59, type: !699, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!972 = !DILocation(line: 59, column: 1, scope: !971)
!973 = !DILocation(line: 60, column: 12, scope: !971)
!974 = distinct !DISubprogram(name: "alloc_atomic", linkageName: "std.internal.gc.alloc_atomic:0[int].80", scope: !698, file: !698, line: 71, type: !33, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !975)
!975 = !{!976}
!976 = !DILocalVariable(name: "sz", arg: 1, scope: !974, file: !409, type: !21)
!977 = !DILocation(line: 71, column: 1, scope: !974)
!978 = !DILocation(line: 0, scope: !974)
!979 = !DILocation(line: 72, column: 29, scope: !974)
!980 = distinct !DISubprogram(name: "alloc", linkageName: "std.internal.gc.alloc:0[int].84", scope: !698, file: !698, line: 65, type: !33, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !981)
!981 = !{!982}
!982 = !DILocalVariable(name: "sz", arg: 1, scope: !980, file: !409, type: !21)
!983 = !DILocation(line: 65, column: 1, scope: !980)
!984 = !DILocation(line: 0, scope: !980)
!985 = !DILocation(line: 66, column: 22, scope: !980)
!986 = distinct !DISubprogram(name: "register_finalizer", linkageName: "std.internal.gc.register_finalizer:0[Ptr[byte]].86", scope: !698, file: !698, line: 102, type: !305, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !987)
!987 = !{!988}
!988 = !DILocalVariable(name: "p", arg: 1, scope: !986, file: !409, type: !35)
!989 = !DILocation(line: 102, column: 1, scope: !986)
!990 = !DILocation(line: 0, scope: !986)
!991 = distinct !DISubprogram(name: "__internal__.to_class_ptr", linkageName: "__internal__.to_class_ptr:0[Ptr[byte],std.internal.types.collections.dict.Dict[str,str]].88", scope: !483, file: !483, line: 339, type: !992, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!992 = !DISubroutineType(types: !993)
!993 = !{!994, !35}
!994 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !995)
!995 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !409, file: !409, size: 448, elements: !996)
!996 = !{!997, !998, !999, !1000, !1001, !1002, !1008}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !995, file: !412, line: 12, baseType: !21, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !995, file: !412, line: 13, baseType: !21, size: 64, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !995, file: !412, line: 14, baseType: !21, size: 64, offset: 128)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !995, file: !412, line: 15, baseType: !21, size: 64, offset: 192)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !995, file: !412, line: 17, baseType: !417, size: 64, offset: 256)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !995, file: !412, line: 18, baseType: !1003, size: 64, offset: 320)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !1005)
!1005 = !{!1006, !1007}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1004, file: !15, line: 101, baseType: !21, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1004, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !995, file: !412, line: 19, baseType: !1003, size: 64, offset: 384)
!1009 = !DILocation(line: 339, column: 5, scope: !991)
!1010 = distinct !DISubprogram(name: "__internal__.class_alloc", linkageName: "__internal__.class_alloc:0[,std.internal.types.collections.dict.Dict[str,str]].90", scope: !483, file: !483, line: 46, type: !1011, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !1028)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!1013}
!1013 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1014)
!1014 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !409, file: !409, size: 448, elements: !1015)
!1015 = !{!1016, !1017, !1018, !1019, !1020, !1021, !1027}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !1014, file: !412, line: 12, baseType: !21, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1014, file: !412, line: 13, baseType: !21, size: 64, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !1014, file: !412, line: 14, baseType: !21, size: 64, offset: 128)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !1014, file: !412, line: 15, baseType: !21, size: 64, offset: 192)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1014, file: !412, line: 17, baseType: !417, size: 64, offset: 256)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !1014, file: !412, line: 18, baseType: !1022, size: 64, offset: 320)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !1024)
!1024 = !{!1025, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1023, file: !15, line: 101, baseType: !21, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1023, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !1014, file: !412, line: 19, baseType: !1022, size: 64, offset: 384)
!1028 = !{!1029, !1030}
!1029 = !DILocalVariable(name: "sz", scope: !1010, file: !483, line: 48, type: !21)
!1030 = !DILocalVariable(name: "obj", scope: !1010, file: !483, line: 49, type: !35)
!1031 = !DILocation(line: 46, column: 5, scope: !1010)
!1032 = !DILocation(line: 48, column: 9, scope: !1010)
!1033 = !DILocation(line: 49, column: 9, scope: !1010)
!1034 = !DILocation(line: 48, column: 14, scope: !1010)
!1035 = !DILocation(line: 49, column: 35, scope: !1010)
!1036 = !DILocation(line: 49, column: 28, scope: !1010)
!1037 = !DILocation(line: 49, column: 68, scope: !1010)
!1038 = !DILocation(line: 55, column: 32, scope: !1010)
!1039 = !DILocation(line: 56, column: 46, scope: !1010)
!1040 = distinct !DISubprogram(name: "__magic__.new", linkageName: "__magic__.new:0[,std.internal.types.collections.dict.Dict[str,str]].91", scope: !483, file: !483, line: 453, type: !1041, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!1043}
!1043 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1044)
!1044 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !409, file: !409, size: 448, elements: !1045)
!1045 = !{!1046, !1047, !1048, !1049, !1050, !1051, !1057}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !1044, file: !412, line: 12, baseType: !21, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1044, file: !412, line: 13, baseType: !21, size: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !1044, file: !412, line: 14, baseType: !21, size: 64, offset: 128)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !1044, file: !412, line: 15, baseType: !21, size: 64, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1044, file: !412, line: 17, baseType: !417, size: 64, offset: 256)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !1044, file: !412, line: 18, baseType: !1052, size: 64, offset: 320)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !1054)
!1054 = !{!1055, !1056}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1053, file: !15, line: 101, baseType: !21, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1053, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !1044, file: !412, line: 19, baseType: !1052, size: 64, offset: 384)
!1058 = !DILocation(line: 453, column: 5, scope: !1040)
!1059 = !DILocation(line: 455, column: 16, scope: !1040)
!1060 = distinct !DISubprogram(name: "std.internal.types.collections.dict.Dict[str,str].__new__", linkageName: "std.internal.types.collections.dict.Dict[str,str]:std.internal.types.collections.dict.Dict.__new__:0.92", scope: !663, file: !663, line: 317, type: !1061, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!1063}
!1063 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1064)
!1064 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !409, file: !409, size: 448, elements: !1065)
!1065 = !{!1066, !1067, !1068, !1069, !1070, !1071, !1077}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !1064, file: !412, line: 12, baseType: !21, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1064, file: !412, line: 13, baseType: !21, size: 64, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !1064, file: !412, line: 14, baseType: !21, size: 64, offset: 128)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !1064, file: !412, line: 15, baseType: !21, size: 64, offset: 192)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1064, file: !412, line: 17, baseType: !417, size: 64, offset: 256)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !1064, file: !412, line: 18, baseType: !1072, size: 64, offset: 320)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !1074)
!1074 = !{!1075, !1076}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1073, file: !15, line: 101, baseType: !21, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1073, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !1064, file: !412, line: 19, baseType: !1072, size: 64, offset: 384)
!1078 = !DILocation(line: 317, column: 317, scope: !1060)
!1079 = !DILocation(line: 11, column: 1, scope: !1060)
!1080 = distinct !DISubprogram(name: "Pointer[UInt32].__new__", linkageName: "Ptr[UInt[32]]:Ptr.__new__:0.93", scope: !509, file: !509, line: 7, type: !1081, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!417}
!1083 = !DILocation(line: 7, column: 5, scope: !1080)
!1084 = distinct !DISubprogram(name: "Pointer[str].__new__", linkageName: "Ptr[str]:Ptr.__new__:0.94", scope: !509, file: !509, line: 7, type: !1085, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!1087}
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !1089)
!1089 = !{!1090, !1091}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1088, file: !15, line: 101, baseType: !21, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1088, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!1092 = !DILocation(line: 7, column: 5, scope: !1084)
!1093 = distinct !DISubprogram(name: "std.internal.types.collections.dict.Dict[str,str]._init", linkageName: "std.internal.types.collections.dict.Dict[str,str]:std.internal.types.collections.dict.Dict._init:0[std.internal.types.collections.dict.Dict[str,str]].95", scope: !412, file: !412, line: 26, type: !1094, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !1111)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!95, !1096}
!1096 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1097)
!1097 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !409, file: !409, size: 448, elements: !1098)
!1098 = !{!1099, !1100, !1101, !1102, !1103, !1104, !1110}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !1097, file: !412, line: 12, baseType: !21, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1097, file: !412, line: 13, baseType: !21, size: 64, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !1097, file: !412, line: 14, baseType: !21, size: 64, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !1097, file: !412, line: 15, baseType: !21, size: 64, offset: 192)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1097, file: !412, line: 17, baseType: !417, size: 64, offset: 256)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !1097, file: !412, line: 18, baseType: !1105, size: 64, offset: 320)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !1107)
!1107 = !{!1108, !1109}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1106, file: !15, line: 101, baseType: !21, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1106, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !1097, file: !412, line: 19, baseType: !1105, size: 64, offset: 384)
!1111 = !{!1112}
!1112 = !DILocalVariable(name: "self", arg: 1, scope: !1093, file: !409, type: !1113)
!1113 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1114)
!1114 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !409, file: !409, size: 448, elements: !1115)
!1115 = !{!1116, !1117, !1118, !1119, !1120, !1121, !1127}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !1114, file: !412, line: 12, baseType: !21, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1114, file: !412, line: 13, baseType: !21, size: 64, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !1114, file: !412, line: 14, baseType: !21, size: 64, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !1114, file: !412, line: 15, baseType: !21, size: 64, offset: 192)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1114, file: !412, line: 17, baseType: !417, size: 64, offset: 256)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !1114, file: !412, line: 18, baseType: !1122, size: 64, offset: 320)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !1124)
!1124 = !{!1125, !1126}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1123, file: !15, line: 101, baseType: !21, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1123, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !1114, file: !412, line: 19, baseType: !1122, size: 64, offset: 384)
!1128 = !DILocation(line: 26, column: 5, scope: !1093)
!1129 = !DILocation(line: 0, scope: !1093)
!1130 = !DILocation(line: 27, column: 9, scope: !1093)
!1131 = !DILocation(line: 27, column: 27, scope: !1093)
!1132 = !DILocation(line: 28, column: 9, scope: !1093)
!1133 = !DILocation(line: 28, column: 22, scope: !1093)
!1134 = !DILocation(line: 29, column: 9, scope: !1093)
!1135 = !DILocation(line: 29, column: 28, scope: !1093)
!1136 = !DILocation(line: 30, column: 9, scope: !1093)
!1137 = !DILocation(line: 30, column: 29, scope: !1093)
!1138 = !DILocation(line: 31, column: 9, scope: !1093)
!1139 = !DILocation(line: 31, column: 23, scope: !1093)
!1140 = !DILocation(line: 32, column: 9, scope: !1093)
!1141 = !DILocation(line: 32, column: 22, scope: !1093)
!1142 = !DILocation(line: 33, column: 9, scope: !1093)
!1143 = !DILocation(line: 33, column: 22, scope: !1093)
!1144 = distinct !DISubprogram(name: "std.internal.types.collections.dict.Dict[str,str].__init__", linkageName: "std.internal.types.collections.dict.Dict[str,str]:std.internal.types.collections.dict.Dict.__init__:1[std.internal.types.collections.dict.Dict[str,str]].97", scope: !412, file: !412, line: 59, type: !1145, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !1162)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!95, !1147}
!1147 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1148)
!1148 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !409, file: !409, size: 448, elements: !1149)
!1149 = !{!1150, !1151, !1152, !1153, !1154, !1155, !1161}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !1148, file: !412, line: 12, baseType: !21, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1148, file: !412, line: 13, baseType: !21, size: 64, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !1148, file: !412, line: 14, baseType: !21, size: 64, offset: 128)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !1148, file: !412, line: 15, baseType: !21, size: 64, offset: 192)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1148, file: !412, line: 17, baseType: !417, size: 64, offset: 256)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !1148, file: !412, line: 18, baseType: !1156, size: 64, offset: 320)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !1158)
!1158 = !{!1159, !1160}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1157, file: !15, line: 101, baseType: !21, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1157, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !1148, file: !412, line: 19, baseType: !1156, size: 64, offset: 384)
!1162 = !{!1163}
!1163 = !DILocalVariable(name: "self", arg: 1, scope: !1144, file: !409, type: !1164)
!1164 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1165)
!1165 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !409, file: !409, size: 448, elements: !1166)
!1166 = !{!1167, !1168, !1169, !1170, !1171, !1172, !1178}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !1165, file: !412, line: 12, baseType: !21, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1165, file: !412, line: 13, baseType: !21, size: 64, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !1165, file: !412, line: 14, baseType: !21, size: 64, offset: 128)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !1165, file: !412, line: 15, baseType: !21, size: 64, offset: 192)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1165, file: !412, line: 17, baseType: !417, size: 64, offset: 256)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !1165, file: !412, line: 18, baseType: !1173, size: 64, offset: 320)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !1175)
!1175 = !{!1176, !1177}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1174, file: !15, line: 101, baseType: !21, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1174, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !1165, file: !412, line: 19, baseType: !1173, size: 64, offset: 384)
!1179 = !DILocation(line: 59, column: 5, scope: !1144)
!1180 = !DILocation(line: 0, scope: !1144)
!1181 = !DILocation(line: 60, column: 9, scope: !1144)
!1182 = distinct !DISubprogram(name: "Tuple.N1[std.internal.types.collections.dict.Dict[str,str]].__new__", linkageName: "Tuple.N1.__new__:0.99", scope: !663, file: !663, line: 830, type: !1183, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{!1185, !1188}
!1185 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple.N1[std.internal.types.collections.dict.Dict[str,str]]", scope: !663, file: !663, line: 813, size: 64, elements: !1186)
!1186 = !{!1187}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "item1", scope: !1185, file: !15, line: 114, baseType: !1188, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1189)
!1189 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !409, file: !409, size: 448, elements: !1190)
!1190 = !{!1191, !1192, !1193, !1194, !1195, !1196, !1202}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !1189, file: !412, line: 12, baseType: !21, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1189, file: !412, line: 13, baseType: !21, size: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !1189, file: !412, line: 14, baseType: !21, size: 64, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !1189, file: !412, line: 15, baseType: !21, size: 64, offset: 192)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1189, file: !412, line: 17, baseType: !417, size: 64, offset: 256)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !1189, file: !412, line: 18, baseType: !1197, size: 64, offset: 320)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !1199)
!1199 = !{!1200, !1201}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1198, file: !15, line: 101, baseType: !21, size: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1198, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !1189, file: !412, line: 19, baseType: !1197, size: 64, offset: 384)
!1203 = !DILocation(line: 830, column: 830, scope: !1182)
!1204 = distinct !DISubprogram(name: "std.os.__init__.EnvMap.__new__", linkageName: "std.os.__init__.EnvMap.__new__:1.101", scope: !532, file: !532, line: 14, type: !1205, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !1225)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!1207}
!1207 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.os.__init__.EnvMap", scope: !532, file: !532, line: 11, size: 64, elements: !1208)
!1208 = !{!1209}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "_map", scope: !1207, file: !532, line: 12, baseType: !1210, size: 64)
!1210 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1211)
!1211 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !409, file: !409, size: 448, elements: !1212)
!1212 = !{!1213, !1214, !1215, !1216, !1217, !1218, !1224}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !1211, file: !412, line: 12, baseType: !21, size: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1211, file: !412, line: 13, baseType: !21, size: 64, offset: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !1211, file: !412, line: 14, baseType: !21, size: 64, offset: 128)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !1211, file: !412, line: 15, baseType: !21, size: 64, offset: 192)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1211, file: !412, line: 17, baseType: !417, size: 64, offset: 256)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !1211, file: !412, line: 18, baseType: !1219, size: 64, offset: 320)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !1221)
!1221 = !{!1222, !1223}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1220, file: !15, line: 101, baseType: !21, size: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1220, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !1211, file: !412, line: 19, baseType: !1219, size: 64, offset: 384)
!1225 = !{!1226}
!1226 = !DILocalVariable(name: "._ctr_196", scope: !1204, file: !532, line: 15, type: !1227)
!1227 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1228)
!1228 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !409, file: !409, size: 448, elements: !1229)
!1229 = !{!1230, !1231, !1232, !1233, !1234, !1235, !1241}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !1228, file: !412, line: 12, baseType: !21, size: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1228, file: !412, line: 13, baseType: !21, size: 64, offset: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !1228, file: !412, line: 14, baseType: !21, size: 64, offset: 128)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !1228, file: !412, line: 15, baseType: !21, size: 64, offset: 192)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1228, file: !412, line: 17, baseType: !417, size: 64, offset: 256)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !1228, file: !412, line: 18, baseType: !1236, size: 64, offset: 320)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !15, file: !15, line: 101, size: 128, elements: !1238)
!1238 = !{!1239, !1240}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1237, file: !15, line: 101, baseType: !21, size: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1237, file: !15, line: 101, baseType: !35, size: 64, offset: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !1228, file: !412, line: 19, baseType: !1236, size: 64, offset: 384)
!1242 = !DILocation(line: 14, column: 5, scope: !1204)
!1243 = !DILocation(line: 15, column: 17, scope: !1204)
!1244 = !DILocation(line: 830, column: 830, scope: !1182, inlinedAt: !1245)
!1245 = distinct !DILocation(line: 15, column: 17, scope: !1204)
!1246 = distinct !DISubprogram(name: "Function[Tuple.N1[Ptr[byte]],NoneType].__new__", linkageName: "Function[Tuple.N1[Ptr[byte]],NoneType]:Function.__new__:0[Ptr[byte]].102", scope: !483, file: !483, line: 652, type: !1247, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!304, !35}
!1249 = !DILocation(line: 652, column: 5, scope: !1246)
!1250 = distinct !DISubprogram(name: "Function[Tuple.N0,NoneType].__new__", linkageName: "Function[Tuple.N0,NoneType]:Function.__new__:0[Ptr[byte]].104", scope: !483, file: !483, line: 652, type: !1251, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!359, !35}
!1253 = !DILocation(line: 652, column: 5, scope: !1250)
!1254 = distinct !DISubprogram(name: "Function[Tuple.N1[Ptr[byte]],Ptr[byte]].__new__", linkageName: "Function[Tuple.N1[Ptr[byte]],Ptr[byte]]:Function.__new__:0[Ptr[byte]].106", scope: !483, file: !483, line: 652, type: !1255, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!41, !35}
!1257 = !DILocation(line: 652, column: 5, scope: !1254)
!1258 = distinct !DISubprogram(name: "Function[Tuple.N0,Ptr[byte]].__new__", linkageName: "Function[Tuple.N0,Ptr[byte]]:Function.__new__:0[Ptr[byte]].108", scope: !483, file: !483, line: 652, type: !1259, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!68, !35}
!1261 = !DILocation(line: 652, column: 5, scope: !1258)
!1262 = distinct !DISubprogram(name: "Function[Tuple.N1[Ptr[byte]],int].__new__", linkageName: "Function[Tuple.N1[Ptr[byte]],int]:Function.__new__:0[Ptr[byte]].110", scope: !483, file: !483, line: 652, type: !1263, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{!85, !35}
!1265 = !DILocation(line: 652, column: 5, scope: !1262)
!1266 = distinct !DISubprogram(name: "Function[Tuple.N1[int],Ptr[byte]].__new__", linkageName: "Function[Tuple.N1[int],Ptr[byte]]:Function.__new__:0[Ptr[byte]].112", scope: !483, file: !483, line: 652, type: !1267, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!32, !35}
!1269 = !DILocation(line: 652, column: 5, scope: !1266)
!1270 = distinct !DISubprogram(name: "Function[Tuple.N1[Ptr[byte]],float].__new__", linkageName: "Function[Tuple.N1[Ptr[byte]],float]:Function.__new__:0[Ptr[byte]].114", scope: !483, file: !483, line: 652, type: !1271, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!1271 = !DISubroutineType(types: !1272)
!1272 = !{!52, !35}
!1273 = !DILocation(line: 652, column: 5, scope: !1270)
!1274 = distinct !DISubprogram(name: "Function[Tuple.N1[float],Ptr[byte]].__new__", linkageName: "Function[Tuple.N1[float],Ptr[byte]]:Function.__new__:0[Ptr[byte]].116", scope: !483, file: !483, line: 652, type: !1275, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!149, !35}
!1277 = !DILocation(line: 652, column: 5, scope: !1274)
!1278 = distinct !DISubprogram(name: "Function[Tuple.N2[Ptr[byte],int],Ptr[byte]].__new__", linkageName: "Function[Tuple.N2[Ptr[byte],int],Ptr[byte]]:Function.__new__:0[Ptr[byte]].118", scope: !483, file: !483, line: 652, type: !1279, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!1279 = !DISubroutineType(types: !1280)
!1280 = !{!164, !35}
!1281 = !DILocation(line: 652, column: 5, scope: !1278)
!1282 = distinct !DISubprogram(name: "Function[Tuple.N3[Ptr[byte],int,Ptr[byte]],Ptr[byte]].__new__", linkageName: "Function[Tuple.N3[Ptr[byte],int,Ptr[byte]],Ptr[byte]]:Function.__new__:0[Ptr[byte]].120", scope: !483, file: !483, line: 652, type: !1283, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{!171, !35}
!1285 = !DILocation(line: 652, column: 5, scope: !1282)
!1286 = distinct !DISubprogram(name: "Function[Tuple.N4[Ptr[byte],Ptr[int],Ptr[Ptr[byte]],Ptr[Ptr[byte]]],int].__new__", linkageName: "Function[Tuple.N4[Ptr[byte],Ptr[int],Ptr[Ptr[byte]],Ptr[Ptr[byte]]],int]:Function.__new__:0[Ptr[byte]].122", scope: !483, file: !483, line: 652, type: !1287, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!1287 = !DISubroutineType(types: !1288)
!1288 = !{!73, !35}
!1289 = !DILocation(line: 652, column: 5, scope: !1286)
!1290 = distinct !DISubprogram(name: "Function[Tuple.N2[Ptr[byte],Ptr[byte]],Ptr[byte]].__new__", linkageName: "Function[Tuple.N2[Ptr[byte],Ptr[byte]],Ptr[byte]]:Function.__new__:0[Ptr[byte]].124", scope: !483, file: !483, line: 652, type: !1291, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{!61, !35}
!1293 = !DILocation(line: 652, column: 5, scope: !1290)
!1294 = distinct !DISubprogram(name: "Function[Tuple.N3[Ptr[byte],Ptr[byte],Ptr[byte]],Ptr[byte]].__new__", linkageName: "Function[Tuple.N3[Ptr[byte],Ptr[byte],Ptr[byte]],Ptr[byte]]:Function.__new__:0[Ptr[byte]].126", scope: !483, file: !483, line: 652, type: !1295, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{!80, !35}
!1297 = !DILocation(line: 652, column: 5, scope: !1294)
!1298 = distinct !DISubprogram(name: "Function[Tuple.N3[Ptr[byte],int,Ptr[byte]],NoneType].__new__", linkageName: "Function[Tuple.N3[Ptr[byte],int,Ptr[byte]],NoneType]:Function.__new__:0[Ptr[byte]].128", scope: !483, file: !483, line: 652, type: !1299, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !17)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{!328, !35}
